const ability = {
  "ability_a1": [
    {
      "name": "アナライズ",
      "explanation": "(+行動順が最後) [威力1.3倍]",
      "check": 1
    },
    {
      "name": "あまのじゃく",
      "explanation": "[能力ランクの変化が逆になる]",
      "check": 0
    },
    {
      "name": "あめふらし",
      "explanation": "[戦闘に出ると雨が降る]",
      "check": 0
    },
    {
      "name": "いかりのつぼ",
      "explanation": "(+急所被弾) [攻撃ランクが最大まで上がる]",
      "check": 1
    },
    {
      "name": "いろめがね",
      "explanation": "[効果がいまひとつの攻撃技 威力2倍]",
      "check": 1
    },
    {
      "name": "いわはこび",
      "explanation": "[岩技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "うるおいボイス",
      "explanation": "[音技→水タイプ化]",
      "check": 1
    },
    {
      "name": "エレキスキン",
      "explanation": "[ノーマル技→電気タイプ化＆威力1.2倍]",
      "check": 1
    },
    {
      "name": "エレキメイカー",
      "explanation": "[戦闘に出るとエレキフィールドにする]",
      "check": 0
    },
    {
      "name": "えんかく",
      "explanation": "[直接攻撃技→非接触技化]",
      "check": 0
    },
    {
      "name": "かいりきバサミ",
      "explanation": "[相手の技や特性で攻撃ランクが下がらない]",
      "check": 0
    },
    {
      "name": "かたいツメ",
      "explanation": "[直接攻撃技 威力 1.3倍]",
      "check": 1
    },
    {
      "name": "かたやぶり",
      "explanation": "[相手の特性の影響を受けずに攻撃できる]",
      "check": 0
    },
    {
      "name": "かちき",
      "explanation": "(能力ランク下降時) [特攻ランク 2段階上昇]",
      "check": 0
    },
    {
      "name": "がんじょうあご",
      "explanation": "[かみつき技 威力 1.3倍]",
      "check": 1
    },
    {
      "name": "きもったま",
      "explanation": "[ゴーストにもノーマル・格闘技が命中, いかく無効]",
      "check": 0
    },
    {
      "name": "きょううん",
      "explanation": "[急所ランク+1]",
      "check": 0
    },
    {
      "name": "きれあじ",
      "explanation": "[斬撃技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "クォークチャージ",
      "explanation": "(+発動時) [最も高い能力 1.3倍]",
      "check": 1
    },
    {
      "name": "グラスメイカー",
      "explanation": "[戦闘に出るとグラスフィールドにする]",
      "check": 0
    },
    {
      "name": "クリアボディ",
      "explanation": "[相手の技や特性によって能力ランクが下がらない]",
      "check": 0
    },
    {
      "name": "げきりゅう",
      "explanation": "(+自分のHPが1/3以下) [水技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "こだいかっせい",
      "explanation": "(+発動時) [最も高い能力 1.3倍]",
      "check": 1
    },
    {
      "name": "ごりむちゅう",
      "explanation": "[物理技 威力1.5倍]",
      "check": 0
    },
    {
      "name": "こんじょう",
      "explanation": "(+自分が状態異常) [攻撃1.5倍]",
      "check": 1
    },
    {
      "name": "サイコメイカー",
      "explanation": "[戦闘に出るとサイコフィールドにする]",
      "check": 0
    },
    {
      "name": "サンパワー",
      "explanation": "(+晴れ) [特攻1.5倍]",
      "check": 1
    },
    {
      "name": "じゅくせい",
      "explanation": "[きのみの効果が2倍になる]",
      "check": 0
    },
    {
      "name": "しろいけむり",
      "explanation": "[相手の技や特性によって能力ランクが下がらない]",
      "check": 0
    },
    {
      "name": "しんりょく",
      "explanation": "(+自分のHPが1/3以下) [草技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "すいほう",
      "explanation": "[水技 威力2倍]",
      "check": 1
    },
    {
      "name": "スカイスキン",
      "explanation": "[ノーマル技→飛行タイプ化＆威力1.2倍]",
      "check": 1
    },
    {
      "name": "スキルリンク",
      "explanation": "[連続技が5回あたる]",
      "check": 1
    },
    {
      "name": "すてみ",
      "explanation": "[すてみ技 威力1.2倍]",
      "check": 1
    },
    {
      "name": "スナイパー",
      "explanation": "[急所補正 1.5倍→2.25倍]",
      "check": 0
    },
    {
      "name": "すなおこし",
      "explanation": "[戦闘に出ると砂嵐が吹く]",
      "check": 0
    },
    {
      "name": "すなのちから",
      "explanation": "(+砂嵐) [地面技,岩技,鋼技 威力1.3倍]",
      "check": 1
    },
    {
      "name": "すりぬけ",
      "explanation": "[リフレクター/ひかりのかべの影響を受けない]",
      "check": 0
    },
    {
      "name": "するどいめ",
      "explanation": "[相手の回避ランクの影響を受けない]",
      "check": 0
    },
    {
      "name": "スロースタート",
      "explanation": "[攻撃・素早さが半分になる]",
      "check": 1
    },
    {
      "name": "せいしんりょく",
      "explanation": "[いかく無効]",
      "check": 0
    },
    {
      "name": "そうだいしょう",
      "explanation": "[瀕死なった味方1体につき 10% 威力上昇]",
      "check": 2
    },
    {
      "name": "ちからずく",
      "explanation": "[追加効果のある技 威力1.3倍]",
      "check": 1
    },
    {
      "name": "ちからもち",
      "explanation": "[攻撃2倍]",
      "check": 0
    },
    {
      "name": "てきおうりょく",
      "explanation": "[一致技ダメージ補正1.5倍→2倍]",
      "check": 1
    },
    {
      "name": "テクニシャン",
      "explanation": "[威力60以下の技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "てつのこぶし",
      "explanation": "[こぶし技 威力1.2倍]",
      "check": 1
    },
    {
      "name": "てんねん",
      "explanation": "[相手の能力ランクの変化の影響を受けない]",
      "check": 0
    },
    {
      "name": "とうそうしん",
      "explanation": "(+異性/同性) [攻撃・特攻 1.25倍/0.75倍]",
      "check": 1
    },
    {
      "name": "どくぼうそう",
      "explanation": "(+自分が毒) [物理技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "トランジスタ",
      "explanation": "[電気技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "どんかん",
      "explanation": "[いかく無効]",
      "check": 0
    },
    {
      "name": "ねつぼうそう",
      "explanation": "(+自分が火傷) [特殊技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "ノーガード",
      "explanation": "[お互いに技が必ず命中する]",
      "check": 0
    },
    {
      "name": "ノーてんき",
      "explanation": "[天気の影響がなくなる]",
      "check": 0
    },
    {
      "name": "ノーマルスキン",
      "explanation": "[全ての技→ノーマルタイプ化＆威力1.2倍]",
      "check": 0
    },
    {
      "name": "はがねつかい",
      "explanation": "[鋼技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "はがねのせいしん",
      "explanation": "[鋼技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "ハドロンエンジン",
      "explanation": "[戦闘に出るとエレキフィールドにする, 特攻4/3倍]",
      "check": 1
    },
    {
      "name": "はりきり",
      "explanation": "[攻撃1.5倍],[物理技 命中率0.8倍]",
      "check": 0
    },
    {
      "name": "はりこみ",
      "explanation": "(+相手が交代時) [威力2倍]",
      "check": 1
    },
    {
      "name": "パンクロック",
      "explanation": "[音技 威力1.3倍]",
      "check": 1
    },
    {
      "name": "ばんけん",
      "explanation": "[いかくされると攻撃ランク1段階上昇]",
      "check": 0
    },
    {
      "name": "ひでり",
      "explanation": "[戦闘に出ると晴れる]",
      "check": 0
    },
    {
      "name": "ひとでなし",
      "explanation": "(相手が毒) [攻撃が必ず急所にあたる]",
      "check": 1
    },
    {
      "name": "ひひいろのこどう",
      "explanation": "[戦闘に出ると晴れる, 攻撃4/3倍]",
      "check": 1
    },
    {
      "name": "フェアリースキン",
      "explanation": "[ノーマル技→フェアリータイプ化＆威力1.2倍]",
      "check": 0
    },
    {
      "name": "ふくがん",
      "explanation": "[命中率1.3倍]",
      "check": 0
    },
    {
      "name": "プラス",
      "explanation": "(+他にプラスかマイナスがいる) [特攻1.5倍]",
      "check": 0
    },
    {
      "name": "フラワーギフト",
      "explanation": "(+晴れ) [攻撃1.5倍]",
      "check": 1
    },
    {
      "name": "フリーズスキン",
      "explanation": "[ノーマル技→氷タイプ化＆威力1.2倍]",
      "check": 1
    },
    {
      "name": "へんげんじざい",
      "explanation": "[行動時に技と同じタイプになる]",
      "check": 1
    },
    {
      "name": "マイナス",
      "explanation": "(+他にプラスかマイナスがいる) [特攻1.5倍]",
      "check": 1
    },
    {
      "name": "マイペース",
      "explanation": "[いかく無効]",
      "check": 0
    },
    {
      "name": "まけんき",
      "explanation": "(能力ランク下降時) [攻撃ランクが2段階上昇する]",
      "check": 0
    },
    {
      "name": "ミストメイカー",
      "explanation": "[戦闘に出るとミストフィールドにする]",
      "check": 0
    },
    {
      "name": "ミラーアーマー",
      "explanation": "[技や特性の能力ランクを下げる効果を反射する]",
      "check": 0
    },
    {
      "name": "むしのしらせ",
      "explanation": "(+自分のHPが1/3以下) [虫技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "メガランチャー",
      "explanation": "[波動技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "もうか",
      "explanation": "(+自分のHPが1/3以下) [炎技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "もらいび",
      "explanation": "(+炎技を受けた後) [炎技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "ゆきふらし",
      "explanation": "[戦闘に出ると雪が降る]",
      "check": 0
    },
    {
      "name": "ヨガパワー",
      "explanation": "[攻撃2倍]",
      "check": 0
    },
    {
      "name": "りゅうのあぎと",
      "explanation": "[ドラゴン技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "わざわいのたま",
      "explanation": "[自分以外の特防 3/4倍]",
      "check": 0
    },
    {
      "name": "わざわいのつるぎ",
      "explanation": "[自分以外の防御 3/4倍]",
      "check": 0
    }
  ],
  "ability_a2": [
    {
      "name": "フラワーギフト",
      "explanation": "(+晴れ) [攻撃1.5倍]",
      "check": 1
    },
    {
      "name": "はがねのせいしん",
      "explanation": "[鋼技 威力1.5倍]",
      "check": 1
    },
    {
      "name": "パワースポット",
      "explanation": "[味方の技 威力1.3倍]",
      "check": 0
    },
    {
      "name": "わざわいのたま",
      "explanation": "[自分以外の特防 3/4倍]",
      "check": 0
    },
    {
      "name": "わざわいのつるぎ",
      "explanation": "[自分以外の防御 3/4倍]",
      "check": 0
    },
    {
      "name": "エレキメイカー",
      "explanation": "[戦闘に出るとエレキフィールドにする]",
      "check": 0
    },
    {
      "name": "サイコメイカー",
      "explanation": "[戦闘に出るとサイコフィールドにする]",
      "check": 0
    },
    {
      "name": "グラスメイカー",
      "explanation": "[戦闘に出るとグラスフィールドにする]",
      "check": 0
    },
    {
      "name": "ミストメイカー",
      "explanation": "[戦闘に出るとミストフィールドにする]",
      "check": 0
    },
    {
      "name": "ひでり",
      "explanation": "[戦闘に出ると晴れる]",
      "check": 0
    },
    {
      "name": "あめふらし",
      "explanation": "[戦闘に出ると雨が降る]",
      "check": 0
    },
    {
      "name": "すなおこし",
      "explanation": "[戦闘に出ると砂嵐が吹く]",
      "check": 0
    },
    {
      "name": "ゆきふらし",
      "explanation": "[戦闘に出ると雪が降る]",
      "check": 0
    },
    {
      "name": "ノーてんき",
      "explanation": "[天気の影響がなくなる]",
      "check": 0
    }
  ],
  "ability_b1": [
    {
      "name": "あついしぼう",
      "explanation": "[炎技,氷技 ダメージ1/2倍]",
      "check": 0
    },
    {
      "name": "あめふらし",
      "explanation": "[戦闘に出ると雨が降る]",
      "check": 0
    },
    {
      "name": "いかく",
      "explanation": "[戦闘に出ると相手の攻撃ランクを1段階下げる]",
      "check": 0
    },
    {
      "name": "エレキメイカー",
      "explanation": "[戦闘に出るとエレキフィールドにする]",
      "check": 0
    },
    {
      "name": "カブトアーマー",
      "explanation": "[自分への攻撃が急所にあたらない]",
      "check": 0
    },
    {
      "name": "かんそうはだ",
      "explanation": "[炎技 ダメージ1.25倍,水技 無効]",
      "check": 0
    },
    {
      "name": "きよめのしお",
      "explanation": "[ゴースト技 ダメージ1/2倍]",
      "check": 0
    },
    {
      "name": "くさのけがわ",
      "explanation": "(+グラスフィールド) [防御1.5倍]",
      "check": 1
    },
    {
      "name": "クォークチャージ",
      "explanation": "(+発動時) [最も高い能力 1.3倍]",
      "check": 1
    },
    {
      "name": "グラスメイカー",
      "explanation": "[戦闘に出るとグラスフィールドにする]",
      "check": 0
    },
    {
      "name": "こおりのりんぷん",
      "explanation": "[特殊技 ダメージ1/2倍]",
      "check": 0
    },
    {
      "name": "こだいかっせい",
      "explanation": "(+発動時) [最も高い能力1.3倍]",
      "check": 1
    },
    {
      "name": "こんがりボディ",
      "explanation": "[炎技 無効]",
      "check": 0
    },
    {
      "name": "サイコメイカー",
      "explanation": "[戦闘に出るとサイコフィールドにする]",
      "check": 0
    },
    {
      "name": "シェルアーマー",
      "explanation": "[自分への攻撃が急所にあたらない]",
      "check": 0
    },
    {
      "name": "じゅくせい",
      "explanation": "[きのみの効果が2倍になる]",
      "check": 0
    },
    {
      "name": "じょおうのいげん",
      "explanation": "[先制技 無効]",
      "check": 0
    },
    {
      "name": "すいほう",
      "explanation": "[炎技 ダメージ1/2倍]",
      "check": 0
    },
    {
      "name": "すなおこし",
      "explanation": "[戦闘に出ると砂嵐が吹く]",
      "check": 0
    },
    {
      "name": "すながくれ",
      "explanation": "(+砂嵐) [相手の命中率 0.8倍]",
      "check": 1
    },
    {
      "name": "そうしょく",
      "explanation": "[草技 無効]",
      "check": 0
    },
    {
      "name": "たいねつ",
      "explanation": "[炎技 ダメージ1/2倍]",
      "check": 0
    },
    {
      "name": "ちくでん",
      "explanation": "[電気技 無効]",
      "check": 0
    },
    {
      "name": "ちどりあし",
      "explanation": "[+混乱] [相手の命中率 0.8倍]",
      "check": 1
    },
    {
      "name": "ちょすい",
      "explanation": "[水技 無効]",
      "check": 0
    },
    {
      "name": "テイルアーマー",
      "explanation": "[先制技 無効]",
      "check": 0
    },
    {
      "name": "でんきエンジン",
      "explanation": "[電気技 無効]",
      "check": 0
    },
    {
      "name": "てんねん",
      "explanation": "[相手の能力ランクの変化の影響を受けない]",
      "check": 0
    },
    {
      "name": "どしょく",
      "explanation": "[地面技 無効]",
      "check": 0
    },
    {
      "name": "ノーガード",
      "explanation": "[お互いに技が必ず命中する]",
      "check": 0
    },
    {
      "name": "ノーてんき",
      "explanation": "[天気の影響がなくなる]",
      "check": 0
    },
    {
      "name": "ハードロック",
      "explanation": "[弱点技 ダメージ3/4倍]",
      "check": 0
    },
    {
      "name": "ハドロンエンジン",
      "explanation": "[戦闘に出るとエレキフィールドにする]",
      "check": 0
    },
    {
      "name": "パンクロック",
      "explanation": "[音技 ダメージ1/2倍]",
      "check": 0
    },
    {
      "name": "ひでり",
      "explanation": "[戦闘に出ると晴れる]",
      "check": 0
    },
    {
      "name": "ひひいろのこどう",
      "explanation": "[戦闘に出ると晴れる]",
      "check": 0
    },
    {
      "name": "ビビッドボディ",
      "explanation": "[先制技 無効]",
      "check": 0
    },
    {
      "name": "ひらいしん",
      "explanation": "[電気技 無効]",
      "check": 0
    },
    {
      "name": "ファーコート",
      "explanation": "[物理技 ダメージ1/2倍]",
      "check": 0
    },
    {
      "name": "フィルター",
      "explanation": "[弱点技 ダメージ3/4倍]",
      "check": 1
    },
    {
      "name": "ふしぎなうろこ",
      "explanation": "(＋自分が状態異常) [防御1.5倍]",
      "check": 1
    },
    {
      "name": "ふゆう",
      "explanation": "[地面技 無効]",
      "check": 0
    },
    {
      "name": "フラワーギフト",
      "explanation": "(+晴れ) [特防1.5倍]",
      "check": 1
    },
    {
      "name": "ヘヴィメタル",
      "explanation": "自分の重さが2倍になる",
      "check": 0
    },
    {
      "name": "ぼうおん",
      "explanation": "[音技 無効]",
      "check": 0
    },
    {
      "name": "ぼうだん",
      "explanation": "[球技 無効]",
      "check": 0
    },
    {
      "name": "ほおぶくろ",
      "explanation": "[きのみを食べるとき追加で1/3回復する]",
      "check": 0
    },
    {
      "name": "マルチスケイル",
      "explanation": "(HP最大のとき) [ダメージ1/2倍]",
      "check": 1
    },
    {
      "name": "ミストメイカー",
      "explanation": "[戦闘に出るとミストフィールドにする]",
      "check": 0
    },
    {
      "name": "もふもふ",
      "explanation": "[直接攻撃技 ダメージ1/2倍,炎技 ダメージ2倍]",
      "check": 1
    },
    {
      "name": "もらいび",
      "explanation": "[炎技 無効]",
      "check": 0
    },
    {
      "name": "ゆきがくれ",
      "explanation": "(+雪のとき) [相手の命中率 0.8倍]",
      "check": 1
    },
    {
      "name": "ゆきふらし",
      "explanation": "[戦闘に出ると雪が降る]",
      "check": 0
    },
    {
      "name": "よびみず",
      "explanation": "[水技 無効]",
      "check": 0
    },
    {
      "name": "ライトメタル",
      "explanation": "[自分の重さが半分になる]",
      "check": 0
    },
    {
      "name": "わざわいのうつわ",
      "explanation": "[自分以外の特攻 3/4倍]",
      "check": 0
    },
    {
      "name": "わざわいのおふだ",
      "explanation": "[自分以外の攻撃 3/4倍]",
      "check": 0
    }
  ],
  "ability_b2": [
    {
      "name": "フラワーギフト",
      "explanation": "(+晴れのとき) [特防1.5倍]",
      "check": 1
    },
    {
      "name": "フレンドガード",
      "explanation": "[味方が受ける技 ダメージ3/4倍]",
      "check": 0
    },
    {
      "name": "ビビッドボディ",
      "explanation": "[先制技 無効]",
      "check": 0
    },
    {
      "name": "じょおうのいげん",
      "explanation": "[先制技 無効]",
      "check": 0
    },
    {
      "name": "テイルアーマー",
      "explanation": "[先制技 無効]",
      "check": 0
    },
    {
      "name": "ひらいしん",
      "explanation": "[電気技 無効]",
      "check": 0
    },
    {
      "name": "よびみず",
      "explanation": "[水技技 無効]",
      "check": 0
    },
    {
      "name": "わざわいのうつわ",
      "explanation": "[自分以外の特攻 3/4倍]",
      "check": 0
    },
    {
      "name": "わざわいのおふだ",
      "explanation": "[自分以外の攻撃 3/4倍]",
      "check": 0
    },
    {
      "name": "エレキメイカー",
      "explanation": "[戦闘に出るとエレキフィールドにする]",
      "check": 0
    },
    {
      "name": "サイコメイカー",
      "explanation": "[戦闘に出るとサイコフィールドにする]",
      "check": 0
    },
    {
      "name": "グラスメイカー",
      "explanation": "[戦闘に出るとグラスフィールドにする]",
      "check": 0
    },
    {
      "name": "ミストメイカー",
      "explanation": "[戦闘に出るとミストフィールドにする]",
      "check": 0
    },
    {
      "name": "ひでり",
      "explanation": "[戦闘に出ると晴れる]",
      "check": 0
    },
    {
      "name": "あめふらし",
      "explanation": "[戦闘に出ると雨が降る]",
      "check": 0
    },
    {
      "name": "すなおこし",
      "explanation": "[戦闘に出ると砂嵐が吹く]",
      "check": 0
    },
    {
      "name": "ゆきふらし",
      "explanation": "[戦闘に出ると雪が降る]",
      "check": 0
    },
    {
      "name": "ノーてんき",
      "explanation": "[天気の影響がなくなる]",
      "check": 0
    }
  ],
  "item_a1": [
    {
      "name": "タイプ強化アイテム",
      "explanation": "[対象タイプの技 威力1.2倍]",
      "check": 1
    },
    {
      "name": "いのちのたま",
      "explanation": "[威力1.3倍]",
      "check": 0
    },
    {
      "name": "こだわりハチマキ",
      "explanation": "[物理技 威力1.5倍]",
      "check": 0
    },
    {
      "name": "こだわりメガネ",
      "explanation": "[特殊技 威力1.5倍]",
      "check": 0
    },
    {
      "name": "たつじんのおび",
      "explanation": "[弱点技 威力1.2倍]",
      "check": 1
    },
    {
      "name": "パンチグローブ",
      "explanation": "[こぶし技 非接触技化＆威力1.2倍]",
      "check": 1
    },
    {
      "name": "ちからのハチマキ",
      "explanation": "[物理技 威力1.1倍]",
      "check": 0
    },
    {
      "name": "ものしりメガネ",
      "explanation": "[特殊技 威力1.1倍]",
      "check": 0
    },
    {
      "name": "いかさまダイス",
      "explanation": "[連続技 4回以上命中率]",
      "check": 0
    },
    {
      "name": "ピントレンズ",
      "explanation": "[急所率1.1倍]",
      "check": 0
    },
    {
      "name": "クリアチャーム",
      "explanation": "[相手の技や特性によって能力ランクが下がらない]",
      "check": 0
    },
    {
      "name": "ノーマルジュエル",
      "explanation": "[ノーマル技 威力1.3倍]",
      "check": 0
    },
    {
      "name": "こうかくレンズ",
      "explanation": "[命中率 1.1倍]",
      "check": 0
    },
    {
      "name": "フォーカスレンズ",
      "explanation": "(+後攻のとき) [命中率 1.2倍]",
      "check": 1
    },
    {
      "name": "ブーストエナジー",
      "explanation": "[こだいかっせい/クォークチャージ 発動]",
      "check": 0
    },
    {
      "name": "でんきだま",
      "explanation": "(ピカチュウのみ) [威力 2倍]",
      "check": 0
    }
  ],
  "item_b1": [
    {
      "name": "タイプ半減きのみ",
      "explanation": "[弱点技 ダメージ1/2倍]",
      "check": 1
    },
    {
      "name": "とつげきチョッキ",
      "explanation": "[特防 1.5倍]",
      "check": 0
    },
    {
      "name": "しんかのきせき",
      "explanation": "(+進化前ポケモン) [防御/特防 1.5倍]",
      "check": 1
    },
    {
      "name": "ひかりのこな",
      "explanation": "[相手の命中率 0.9倍]",
      "check": 0
    },
    {
      "name": "ブーストエナジー",
      "explanation": "[こだいかっせい/クォークチャージ 発動]",
      "check": 0
    },
    {
      "name": "くろいてっきゅう",
      "explanation": "[地面技が無効化できない]",
      "check": 0
    }
  ],
  "type_list": [
    {
      "type": "ノーマル",
      "colour": "A8A878",
      "compatibility": {
        "ノーマル": 1,
        "ほのお": 1,
        "みず": 1,
        "でんき": 1,
        "くさ": 1,
        "こおり": 1,
        "かくとう": 1,
        "どく": 1,
        "じめん": 1,
        "ひこう": 1,
        "エスパー": 1,
        "むし": 1,
        "いわ": 0.5,
        "ゴースト": 0,
        "ドラゴン": 1,
        "あく": 1,
        "はがね": 0.5,
        "フェアリー": 1
      }
    },
    {
      "type": "ほのお",
      "colour": "F08030",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 0.5,
          "みず": 0.5,
          "でんき": 1,
          "くさ": 2,
          "こおり": 2,
          "かくとう": 1,
          "どく": 1,
          "じめん": 1,
          "ひこう": 1,
          "エスパー": 1,
          "むし": 2,
          "いわ": 0.5,
          "ゴースト": 1,
          "ドラゴン": 0.5,
          "あく": 1,
          "はがね": 2,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "みず",
      "colour": "6890F0",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 2,
          "みず": 0.5,
          "でんき": 1,
          "くさ": 0.5,
          "こおり": 1,
          "かくとう": 1,
          "どく": 1,
          "じめん": 2,
          "ひこう": 1,
          "エスパー": 1,
          "むし": 1,
          "いわ": 2,
          "ゴースト": 1,
          "ドラゴン": 0.5,
          "あく": 1,
          "はがね": 1,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "でんき",
      "colour": "F8D030",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 1,
          "みず": 2,
          "でんき": 0.5,
          "くさ": 0.5,
          "こおり": 1,
          "かくとう": 1,
          "どく": 1,
          "じめん": 0,
          "ひこう": 2,
          "エスパー": 1,
          "むし": 1,
          "いわ": 1,
          "ゴースト": 1,
          "ドラゴン": 0.5,
          "あく": 1,
          "はがね": 1,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "くさ",
      "colour": "78C850",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 0.5,
          "みず": 2,
          "でんき": 1,
          "くさ": 0.5,
          "こおり": 1,
          "かくとう": 1,
          "どく": 0.5,
          "じめん": 2,
          "ひこう": 0.5,
          "エスパー": 1,
          "むし": 0.5,
          "いわ": 2,
          "ゴースト": 1,
          "ドラゴン": 0.5,
          "あく": 1,
          "はがね": 0.5,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "こおり",
      "colour": "98D8D8",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 0.5,
          "みず": 0.5,
          "でんき": 1,
          "くさ": 2,
          "こおり": 0.5,
          "かくとう": 1,
          "どく": 1,
          "じめん": 2,
          "ひこう": 2,
          "エスパー": 1,
          "むし": 1,
          "いわ": 1,
          "ゴースト": 1,
          "ドラゴン": 2,
          "あく": 1,
          "はがね": 0.5,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "かくとう",
      "colour": "C03028",
      "compatibility": [
        {
          "ノーマル": 2,
          "ほのお": 1,
          "みず": 1,
          "でんき": 1,
          "くさ": 1,
          "こおり": 2,
          "かくとう": 1,
          "どく": 0.5,
          "じめん": 1,
          "ひこう": 0.5,
          "エスパー": 0.5,
          "むし": 0.5,
          "いわ": 2,
          "ゴースト": 0,
          "ドラゴン": 1,
          "あく": 2,
          "はがね": 2,
          "フェアリー": 0.5
        }
      ]
    },
    {
      "type": "どく",
      "colour": "A040A0",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 1,
          "みず": 1,
          "でんき": 1,
          "くさ": 2,
          "こおり": 1,
          "かくとう": 1,
          "どく": 0.5,
          "じめん": 0.5,
          "ひこう": 1,
          "エスパー": 1,
          "むし": 1,
          "いわ": 0.5,
          "ゴースト": 0.5,
          "ドラゴン": 1,
          "あく": 1,
          "はがね": 0,
          "フェアリー": 2
        }
      ]
    },
    {
      "type": "じめん",
      "colour": "E0C068",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 2,
          "みず": 1,
          "でんき": 2,
          "くさ": 0.5,
          "こおり": 1,
          "かくとう": 1,
          "どく": 2,
          "じめん": 1,
          "ひこう": 0,
          "エスパー": 1,
          "むし": 0.5,
          "いわ": 2,
          "ゴースト": 1,
          "ドラゴン": 1,
          "あく": 1,
          "はがね": 2,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "ひこう",
      "colour": "A890F0",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 1,
          "みず": 1,
          "でんき": 0.5,
          "くさ": 2,
          "こおり": 1,
          "かくとう": 2,
          "どく": 1,
          "じめん": 1,
          "ひこう": 1,
          "エスパー": 1,
          "むし": 2,
          "いわ": 0.5,
          "ゴースト": 1,
          "ドラゴン": 1,
          "あく": 1,
          "はがね": 0.5,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "エスパー",
      "colour": "F85888",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 1,
          "みず": 1,
          "でんき": 1,
          "くさ": 1,
          "こおり": 1,
          "かくとう": 2,
          "どく": 2,
          "じめん": 1,
          "ひこう": 1,
          "エスパー": 0.5,
          "むし": 1,
          "いわ": 1,
          "ゴースト": 1,
          "ドラゴン": 1,
          "あく": 0,
          "はがね": 0.5,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "むし",
      "colour": "A8B820",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 0.5,
          "みず": 1,
          "でんき": 1,
          "くさ": 2,
          "こおり": 1,
          "かくとう": 0.5,
          "どく": 0.5,
          "じめん": 1,
          "ひこう": 0.5,
          "エスパー": 2,
          "むし": 1,
          "いわ": 1,
          "ゴースト": 0.5,
          "ドラゴン": 1,
          "あく": 2,
          "はがね": 0.5,
          "フェアリー": 0.5
        }
      ]
    },
    {
      "type": "いわ",
      "colour": "B8A038",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 2,
          "みず": 1,
          "でんき": 1,
          "くさ": 1,
          "こおり": 2,
          "かくとう": 0.5,
          "どく": 1,
          "じめん": 0.5,
          "ひこう": 2,
          "エスパー": 1,
          "むし": 2,
          "いわ": 1,
          "ゴースト": 1,
          "ドラゴン": 1,
          "あく": 1,
          "はがね": 0.5,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "ゴースト",
      "colour": "705898",
      "compatibility": [
        {
          "ノーマル": 0,
          "ほのお": 1,
          "みず": 1,
          "でんき": 1,
          "くさ": 1,
          "こおり": 1,
          "かくとう": 1,
          "どく": 1,
          "じめん": 1,
          "ひこう": 1,
          "エスパー": 2,
          "むし": 1,
          "いわ": 1,
          "ゴースト": 2,
          "ドラゴン": 1,
          "あく": 0.5,
          "はがね": 1,
          "フェアリー": 1
        }
      ]
    },
    {
      "type": "ドラゴン",
      "colour": "7038F8",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 1,
          "みず": 1,
          "でんき": 1,
          "くさ": 1,
          "こおり": 1,
          "かくとう": 1,
          "どく": 1,
          "じめん": 1,
          "ひこう": 1,
          "エスパー": 1,
          "むし": 1,
          "いわ": 1,
          "ゴースト": 1,
          "ドラゴン": 2,
          "あく": 1,
          "はがね": 0.5,
          "フェアリー": 0
        }
      ]
    },
    {
      "type": "あく",
      "colour": "705848",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 1,
          "みず": 1,
          "でんき": 1,
          "くさ": 1,
          "こおり": 1,
          "かくとう": 0.5,
          "どく": 1,
          "じめん": 1,
          "ひこう": 1,
          "エスパー": 2,
          "むし": 1,
          "いわ": 1,
          "ゴースト": 2,
          "ドラゴン": 1,
          "あく": 0.5,
          "はがね": 1,
          "フェアリー": 0.5
        }
      ]
    },
    {
      "type": "はがね",
      "colour": "B8B8D0",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 0.5,
          "みず": 0.5,
          "でんき": 0.5,
          "くさ": 1,
          "こおり": 2,
          "かくとう": 1,
          "どく": 1,
          "じめん": 1,
          "ひこう": 1,
          "エスパー": 1,
          "むし": 1,
          "いわ": 2,
          "ゴースト": 1,
          "ドラゴン": 1,
          "あく": 1,
          "はがね": 0.5,
          "フェアリー": 2
        }
      ]
    },
    {
      "type": "フェアリー",
      "colour": "EE99AC",
      "compatibility": [
        {
          "ノーマル": 1,
          "ほのお": 0.5,
          "みず": 1,
          "でんき": 1,
          "くさ": 1,
          "こおり": 1,
          "かくとう": 2,
          "どく": 0.5,
          "じめん": 1,
          "ひこう": 1,
          "エスパー": 1,
          "むし": 1,
          "いわ": 1,
          "ゴースト": 1,
          "ドラゴン": 2,
          "あく": 2,
          "はがね": 0.5,
          "フェアリー": 1
        }
      ]
    }
  ]
}
